In [1]:
import numpy as np
import pandas as pd

In [2]:
#reading the data from csv file
raw_data = pd.read_csv('Social_Network_Ads.csv')
raw_data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
#converting data type of Gender column (string ---> int)
new_data = pd.get_dummies(raw_data.Gender)
new_data.head()

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1

In [7]:
#concatinating female and male column with raw_data table
joinData = pd.concat([raw_data,new_data], axis='columns')
joinData.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  Female  Male
0  15624510    Male   19            19000          0       0     1
1  15810944    Male   35            20000          0       0     1
2  15668575  Female   26            43000          0       1     0
3  15603246  Female   27            57000          0       1     0
4  15804002    Male   19            76000          0       0     1

In [8]:
#droping unwanted columns like Gender and (male or female ---- any one)
finalData = joinData.drop(['Gender', 'Female'], axis='columns')
finalData

      User ID  Age  EstimatedSalary  Purchased  Male
0    15624510   19            19000          0     1
1    15810944   35            20000          0     1
2    15668575   26            43000          0     0
3    15603246   27            57000          0     0
4    15804002   19            76000          0     1
..        ...  ...              ...        ...   ...
395  15691863   46            41000          1     0
396  15706071   51            23000          1     1
397  15654296   50            20000          1     0
398  15755018   36            33000          0     1
399  15594041   49            36000          1     0

[400 rows x 5 columns]

In [9]:
#dividing the dependent and independent columns
# x will store all columns except 'Purchased' column
x = finalData.drop(['Purchased'],axis='columns')
x.head()

    User ID  Age  EstimatedSalary  Male
0  15624510   19            19000     1
1  15810944   35            20000     1
2  15668575   26            43000     0
3  15603246   27            57000     0
4  15804002   19            76000     1

In [10]:
# y will store only 'Purchased' column
y = finalData.Purchased
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [13]:
#spliting the dataset into two parts == train data and test data
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [14]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
x_train = sc_x.fit_transform(x_train)
x_test = sc_x.fit_transform(x_test)

In [16]:
from sklearn.linear_model import LogisticRegression
createModel = LogisticRegression(random_state = 0)
model = createModel.fit(x_train,y_train)

# from sklearn.linear_model import LogisticRegression
# createModel=LogisticRegression(random_state=0)
# myModel=createModel.fit(x_train,y_train)

In [17]:
y_prediction =  createModel.predict(x_test)
y_prediction

array([1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0], dtype=int64)

In [20]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test,y_prediction)
cm

array([[46,  3],
       [ 8, 23]], dtype=int64)

In [21]:
ac = (46+23)/(46+3+8+23)
ac

0.8625